In [2]:
import pandas as pd

## 인덱스index 다루기
- 인덱스의 일부 변경하는 경우

- 특정 컬럼(열)을 인덱스 설정하는 경우

- 기존 인덱스에 새로 추가하는 경우

- 0-base 인덱스로 리셋하는 경우

In [23]:
import pandas as pd

data = {'이름' : [ '서준', '우현', '인아'],
        '수학' : [ 90, 80, 70],
        '영어' : [ 98, 89, 95],
        '음악' : [ 85, 95, 100],
        '체육' : [ 100, 90, 90]}

df = pd.DataFrame(data)
# df.set_index('이름', inplace = True)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [24]:
# DF의 속성 읽기 > index, columns, shape
print(f'index : {df.index.values}')
print(f'columns : {df.columns.values}')
print(f'shape : {df.shape}')

print(f'info : {df.info()}')

index : [0 1 2]
columns : ['이름' '수학' '영어' '음악' '체육']
shape : (3, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   수학      3 non-null      int64
 2   영어      3 non-null      int64
 3   음악      3 non-null      int64
 4   체육      3 non-null      int64
dtypes: int64(4), object(1)
memory usage: 248.0+ bytes
info : None

In [25]:
# 특정 컬럼을 인덱스 설정 > 중복, null 없어야한다 > 멀티 인덱스

df.set_index('이름')

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [34]:
df.set_index(['이름', '수학'], inplace= True)

KeyError: "None of ['이름', '수학'] are in the columns"

In [35]:
# 인덱스 초기화(리셋)
# - 기존 인덱스는 컬럼으로 추가

df.reset_index(inplace = True)

In [29]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [30]:
df.loc[3] = ['서준', 89, 34,25,90]
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3  서준  89  34   25   90

In [31]:
df.reindex(['아', '왜', '안', '돼'])

    이름  수학  영어  음악  체육
아  NaN NaN NaN NaN NaN
왜  NaN NaN NaN NaN NaN
안  NaN NaN NaN NaN NaN
돼  NaN NaN NaN NaN NaN

# 인덱스 재배열 설정
- 기존 인덱스에 변경을 가하는 것
- 원본 적용 inplace=False 기본값
- 메서드 : DF.객체변수명.reindex([인덱스 리스트])

In [39]:
df1=df.reindex([0,1,2,3,4,5])
df1

    이름    수학    영어     음악     체육
0   서준  90.0  98.0   85.0  100.0
1   우현  80.0  89.0   95.0   90.0
2   인아  70.0  95.0  100.0   90.0
3   서준  89.0  34.0   25.0   90.0
4  NaN   NaN   NaN    NaN    NaN
5  NaN   NaN   NaN    NaN    NaN

In [43]:
df1.reindex([0,'a'], fill_value=0)
df1.shape

(6, 5)

In [44]:
# DF객체변수명.rename( index=(기존인덱스 : 새 인덱스), inplace )
# --> 원본에 적용하려면 inplace

## 인덱스 & 컬럼 일부분 변경
- 기존 인덱스/컬럼에서 일부분 변경하는 메서드
- DF객체변수명.rename( index=(기존인덱스 : 새로운 인덱스), inplace=False ) => 행
- DF객체변수명.colums( index=(기존인덱스 : 새로운 인덱스), inplace=False ) => 열

In [59]:
df1.rename(columns={'수학' :'MATH', '음악':'Music'}, inplace=False)

    이름  MATH    영어  Music     체육
0   서준  90.0  98.0   85.0  100.0
1   우현  80.0  89.0   95.0   90.0
2   인아  70.0  95.0  100.0   90.0
3   서준  89.0  34.0   25.0   90.0
4  NaN   NaN   NaN    NaN    NaN
5  NaN   NaN   NaN    NaN    NaN